---
kind: enumMember
id: F:Autodesk.Revit.DB.CompoundStructureError.ExtensibleRegionsNotContiguousAlongTop
enum: Autodesk.Revit.DB.CompoundStructureError
source: html/8e8457e0-84c4-ccb1-114c-fa25a6d37fed.htm
---
# Autodesk.Revit.DB.CompoundStructureError.ExtensibleRegionsNotContiguousAlongTop

Extension Layers at the top of the wall must be adjacent.